wrk+async/get-lock.log
./wrk2/wrk -t4 -c4 -d120s -R10000 -s get.lua --latency http://localhost:8080
Running 2m test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 2.275ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.053ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.592ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.145ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.04ms  542.39us  18.35ms   63.54%
    Req/Sec     2.62k   248.39     6.30k    65.12%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.04ms
 75.000%    1.44ms
 90.000%    1.76ms
 99.000%    1.96ms
 99.900%    2.52ms
 99.990%   11.95ms
 99.999%   17.22ms
100.000%   18.37ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.081     0.000000            1         1.00
       0.319     0.100000       110100         1.11
       0.536     0.200000       220087         1.25
       0.752     0.300000       329986         1.43
       0.930     0.400000       440402         1.67
       1.040     0.500000       550875         2.00
       1.094     0.550000       605690         2.22
       1.149     0.600000       660777         2.50
       1.222     0.650000       715242         2.86
       1.330     0.700000       770234         3.33
       1.439     0.750000       825265         4.00
       1.492     0.775000       852594         4.44
       1.546     0.800000       880129         5.00
       1.600     0.825000       907621         5.71
       1.655     0.850000       935359         6.67
       1.707     0.875000       962509         8.00
       1.735     0.887500       976430         8.89
       1.762     0.900000       990048        10.00
       1.789     0.912500      1003916        11.43
       1.815     0.925000      1017617        13.33
       1.842     0.937500      1031214        16.00
       1.856     0.943750      1038309        17.78
       1.870     0.950000      1045309        20.00
       1.883     0.956250      1052301        22.86
       1.897     0.962500      1059044        26.67
       1.910     0.968750      1065793        32.00
       1.917     0.971875      1069058        35.56
       1.924     0.975000      1072561        40.00
       1.931     0.978125      1075999        45.71
       1.938     0.981250      1079319        53.33
       1.946     0.984375      1083062        64.00
       1.949     0.985938      1084504        71.11
       1.953     0.987500      1086261        80.00
       1.958     0.989062      1088103        91.43
       1.964     0.990625      1089917       106.67
       1.969     0.992188      1091395       128.00
       1.973     0.992969      1092371       142.22
       1.977     0.993750      1093137       160.00
       1.982     0.994531      1093974       182.86
       1.989     0.995313      1094869       213.33
       1.996     0.996094      1095689       256.00
       2.001     0.996484      1096117       284.44
       2.008     0.996875      1096554       320.00
       2.016     0.997266      1096943       365.71
       2.030     0.997656      1097378       426.67
       2.059     0.998047      1097802       512.00
       2.095     0.998242      1098007       568.89
       2.169     0.998437      1098219       640.00
       2.257     0.998633      1098434       731.43
       2.365     0.998828      1098651       853.33
       2.531     0.999023      1098863      1024.00
       2.671     0.999121      1098972      1137.78
       2.835     0.999219      1099080      1280.00
       3.107     0.999316      1099186      1462.86
       3.585     0.999414      1099293      1706.67
       4.483     0.999512      1099400      2048.00
       5.151     0.999561      1099454      2275.56
       5.819     0.999609      1099508      2560.00
       6.555     0.999658      1099562      2925.71
       7.335     0.999707      1099615      3413.33
       8.327     0.999756      1099669      4096.00
       8.783     0.999780      1099696      4551.11
       9.287     0.999805      1099723      5120.00
       9.751     0.999829      1099750      5851.43
      10.431     0.999854      1099777      6826.67
      11.151     0.999878      1099803      8192.00
      11.567     0.999890      1099817      9102.22
      12.023     0.999902      1099830     10240.00
      12.535     0.999915      1099845     11702.86
      13.111     0.999927      1099857     13653.33
      13.607     0.999939      1099870     16384.00
      13.999     0.999945      1099877     18204.44
      14.311     0.999951      1099884     20480.00
      14.807     0.999957      1099891     23405.71
      15.119     0.999963      1099897     27306.67
      15.455     0.999969      1099905     32768.00
      15.663     0.999973      1099907     36408.89
      15.935     0.999976      1099911     40960.00
      16.039     0.999979      1099914     46811.43
      16.327     0.999982      1099917     54613.33
      16.799     0.999985      1099921     65536.00
      16.927     0.999986      1099923     72817.78
      17.071     0.999988      1099924     81920.00
      17.215     0.999989      1099926     93622.86
      17.295     0.999991      1099927    109226.67
      17.503     0.999992      1099930    131072.00
      17.503     0.999993      1099930    145635.56
      17.631     0.999994      1099931    163840.00
      17.791     0.999995      1099932    187245.71
      17.791     0.999995      1099932    218453.33
      17.807     0.999996      1099933    262144.00
      17.871     0.999997      1099934    291271.11
      17.871     0.999997      1099934    327680.00
      18.079     0.999997      1099935    374491.43
      18.079     0.999998      1099935    436906.67
      18.079     0.999998      1099935    524288.00
      18.095     0.999998      1099936    582542.22
      18.095     0.999998      1099936    655360.00
      18.095     0.999999      1099936    748982.86
      18.095     0.999999      1099936    873813.33
      18.095     0.999999      1099936   1048576.00
      18.367     0.999999      1099937   1165084.44
      18.367     1.000000      1099937          inf
#[Mean    =        1.045, StdDeviation   =        0.542]
#[Max     =       18.352, Total count    =      1099937]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1199977 requests in 2.00m, 78.86MB read
  Non-2xx or 3xx responses: 1092300
Requests/sec:   9999.87
Transfer/sec:    672.94KB