wrk+async/put-CPU.log
./wrk2/wrk -t4 -c4 -d120s -R10000 -s put.lua --latency http://localhost:8080
Running 2m test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 1.163ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.152ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.210ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.113ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.12ms    1.22ms  76.22ms   98.67%
    Req/Sec     2.63k   335.66     9.00k    90.70%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.03ms
 75.000%    1.44ms
 90.000%    1.77ms
 99.000%    4.14ms
 99.900%   14.91ms
 99.990%   47.13ms
 99.999%   73.47ms
100.000%   76.29ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.072     0.000000            2         1.00
       0.313     0.100000       110042         1.11
       0.534     0.200000       220370         1.25
       0.752     0.300000       330124         1.43
       0.923     0.400000       440635         1.67
       1.033     0.500000       550169         2.00
       1.089     0.550000       605876         2.22
       1.144     0.600000       660442         2.50
       1.224     0.650000       715527         2.86
       1.333     0.700000       770433         3.33
       1.442     0.750000       825236         4.00
       1.496     0.775000       852536         4.44
       1.551     0.800000       880277         5.00
       1.606     0.825000       907726         5.71
       1.660     0.850000       935261         6.67
       1.714     0.875000       962501         8.00
       1.743     0.887500       976648         8.89
       1.769     0.900000       989949        10.00
       1.796     0.912500      1003770        11.43
       1.824     0.925000      1017677        13.33
       1.851     0.937500      1031525        16.00
       1.865     0.943750      1038403        17.78
       1.879     0.950000      1045372        20.00
       1.893     0.956250      1052215        22.86
       1.907     0.962500      1059169        26.67
       1.920     0.968750      1065756        32.00
       1.927     0.971875      1069044        35.56
       1.936     0.975000      1072829        40.00
       1.945     0.978125      1075957        45.71
       1.961     0.981250      1079406        53.33
       1.999     0.984375      1082763        64.00
       2.123     0.985938      1084472        71.11
       2.639     0.987500      1086191        80.00
       3.543     0.989062      1087914        91.43
       4.555     0.990625      1089632       106.67
       5.623     0.992188      1091348       128.00
       6.207     0.992969      1092211       142.22
       6.867     0.993750      1093065       160.00
       7.587     0.994531      1093924       182.86
       8.431     0.995313      1094788       213.33
       9.343     0.996094      1095651       256.00
       9.807     0.996484      1096078       284.44
      10.311     0.996875      1096509       320.00
      10.831     0.997266      1096932       365.71
      11.407     0.997656      1097362       426.67
      12.063     0.998047      1097792       512.00
      12.455     0.998242      1098013       568.89
      12.911     0.998437      1098221       640.00
      13.487     0.998633      1098439       731.43
      14.183     0.998828      1098652       853.33
      15.047     0.999023      1098868      1024.00
      15.479     0.999121      1098973      1137.78
      15.999     0.999219      1099080      1280.00
      16.607     0.999316      1099188      1462.86
      17.279     0.999414      1099295      1706.67
      18.079     0.999512      1099404      2048.00
      18.495     0.999561      1099456      2275.56
      18.991     0.999609      1099510      2560.00
      19.551     0.999658      1099567      2925.71
      20.223     0.999707      1099617      3413.33
      21.327     0.999756      1099671      4096.00
      22.191     0.999780      1099698      4551.11
      23.455     0.999805      1099725      5120.00
      25.311     0.999829      1099752      5851.43
      31.631     0.999854      1099778      6826.67
      39.807     0.999878      1099805      8192.00
      44.095     0.999890      1099819      9102.22
      48.063     0.999902      1099832     10240.00
      52.191     0.999915      1099846     11702.86
      56.127     0.999927      1099859     13653.33
      59.039     0.999939      1099872     16384.00
      60.799     0.999945      1099879     18204.44
      62.751     0.999951      1099886     20480.00
      64.575     0.999957      1099893     23405.71
      66.111     0.999963      1099899     27306.67
      67.839     0.999969      1099906     32768.00
      68.223     0.999973      1099909     36408.89
      69.119     0.999976      1099913     40960.00
      70.079     0.999979      1099916     46811.43
      70.975     0.999982      1099919     54613.33
      72.127     0.999985      1099923     65536.00
      72.383     0.999986      1099924     72817.78
      72.959     0.999988      1099926     81920.00
      73.471     0.999989      1099928     93622.86
      73.727     0.999991      1099929    109226.67
      74.239     0.999992      1099931    131072.00
      74.495     0.999993      1099932    145635.56
      74.751     0.999994      1099933    163840.00
      75.007     0.999995      1099934    187245.71
      75.007     0.999995      1099934    218453.33
      75.327     0.999996      1099935    262144.00
      75.583     0.999997      1099936    291271.11
      75.583     0.999997      1099936    327680.00
      75.775     0.999997      1099937    374491.43
      75.775     0.999998      1099937    436906.67
      75.775     0.999998      1099937    524288.00
      76.031     0.999998      1099938    582542.22
      76.031     0.999998      1099938    655360.00
      76.031     0.999999      1099938    748982.86
      76.031     0.999999      1099938    873813.33
      76.031     0.999999      1099938   1048576.00
      76.287     0.999999      1099939   1165084.44
      76.287     1.000000      1099939          inf
#[Mean    =        1.120, StdDeviation   =        1.215]
#[Max     =       76.224, Total count    =      1099939]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1199979 requests in 2.00m, 76.67MB read
Requests/sec:   9999.86
Transfer/sec:    654.29KB